RIET/src/Catalogs/RulesOfBlacklist/RulesOfBlacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RulesOfBlacklist</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Field</name>
    <type>
      <types>EnumRef.FieldsForRulesOfBlacklist</types>
    </type>
  </attributes>
  <attributes>
    <name>Value</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.TypesOfRulesOfBlacklist</types>
    </type>
  </attributes>
  <attributes>
    <name>GoodsDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reason</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/FieldsForRulesOfBlacklist/FieldsForRulesOfBlacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FieldsForRulesOfBlacklist</name>
  <enumValues>
    <name>КодПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/RulesOfBlacklist/Forms/ФормаЭлемента/Module.bsl
/////////////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	TypeOfComparison = ПолучитьTypeOfComparison(Объект.Field);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РГСофтКлиент.ПроверитьНеобходимостьЗаписиСправочника(Модифицированность, Отказ);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофтКлиентСервер.УстановитьЗначение(ТекущийОбъект.ModifiedBy, ПараметрыСеанса.ТекущийПользователь);
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ЭЛЕМЕНТЫ УПРАВЛЕНИЯ

&НаКлиенте
Процедура FieldПриИзменении(Элемент)
	
	TypeOfComparison = ПолучитьTypeOfComparison(Объект.Field);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ

&НаСервереБезКонтекста
Функция ПолучитьTypeOfComparison(Field)
	
	Если Field = Перечисления.FieldsForRulesOfBlacklist.КодПоставщика Тогда
		Возврат "equal to";
	ИначеЕсли Field = Перечисления.FieldsForRulesOfBlacklist.ОписаниеНоменклатуры Тогда
		Возврат "contains";
	Иначе
		Возврат "";
	КонецЕсли; 
	
КонецФункции
